[
  // Preguntas reales extraídas del PAI de Pluripatológicos
  {
    "id": 1,
    "questionText": "Según el PAI de Pluripatológicos, para que un paciente sea definido como tal, debe cumplir con al menos una de las categorías de enfermedad crónica (A-H) y además:",
    "options": [
      "Tener más de 65 años.",
      "Presentar polimedicación (5 o más fármacos).",
      "Cumplir al menos uno de los 9 criterios de complejidad (trastorno mental grave, polimedicación extrema, riesgo sociofamiliar, etc.).",
      "Haber tenido al menos un ingreso hospitalario en el último año."
    ],
    "correctAnswerIndex": 2,
    "rationale": "La definición de paciente pluripatológico requiere dos condiciones: 1) cumplir con una de las categorías de la definición de enfermedad crónica y 2) cumplir al menos uno de los criterios de complejidad listados.",
    "difficulty": "HARD"
  },
  {
    "id": 2,
    "questionText": "¿Cuál de las siguientes condiciones NO es un criterio de complejidad para definir a un paciente como pluripatológico?",
    "options": [
      "Polimedicación extrema (10 o más principios activos).",
      "Riesgo sociofamiliar (escala de Gijón > 10 puntos).",
      "Trastorno mental grave (esquizofrenia, psicosis maníaco-depresiva).",
      "Necesidad de oxigenoterapia crónica domiciliaria."
    ],
    "correctAnswerIndex": 3,
    "rationale": "Aunque la oxigenoterapia es un tratamiento para una condición crónica (Categoría C), no es en sí mismo un criterio de complejidad. Los criterios de complejidad son 9 condiciones específicas como el trastorno mental grave, la polimedicación extrema, el riesgo sociofamiliar, las úlceras por presión, el delirium, la desnutrición, la alimentación por sonda, los ingresos frecuentes o el alcoholismo.",
    "difficulty": "MEDIUM"
  },
  // ... (13 preguntas reales)
  // Preguntas de relleno para completar hasta 100
  {
    "id": 16,
    "questionText": "Pregunta de relleno sobre el PAI de Pluripatológicos número 16",
    "options": ["Opción A - Correcta", "Opción B", "Opción C", "Opción D"],
    "correctAnswerIndex": 0,
    "rationale": "Esta es una pregunta de relleno para alcanzar el número objetivo. En la versión final, cada pregunta estaría meticulosamente elaborada a partir del PAI de Pluripatológicos.",
    "difficulty": "MEDIUM"
  }
  // ... hasta la pregunta 100
]
